#include <iostream>
using namespace std;

// task 1
/* В елементах «звʼязного циклічного списку» розміщені цілі числа. Написати
функцію, що розбиває множину поданих чисел на дві: з парними та непарними
значеннями, використовуючи для множин представлення «звʼязними циклічними
списками». */

// task 2
/* Написати функцію для перетворення виразу з цілих чисел та операцій «-», «/»,
записаного у звичайній «інфіксній формі» у представлення в формі ПОЛІЗ.
Потрібний стек реалізувати власноруч. */

// task 3
/* Написати функцію, яка для графа визначає всі вершини, відстань яких від заданої
вершини v становить d. Граф представлений «структурою суміжності». */

