#include <iostream>
using namespace std;

// task 1
/* Поліном від однієї змінної з цілими коефіцієнтами можна подати звʼязним списком, 
впорядкованим за зростанням степені змінної, без зберігання одночленів з нульовими 
коефіцієнтами. Написати функцію, яка знаходить суму двох поліномів. */

// task 2
/* Написати не рекурсивну функцію для друкування відміток вузлів бінарного дерева, поданого у «стандартній формі», 
при його проходженні у «порівневому порядку» (корінь, сини, сини синів, ...). */

// task 3
/* Написати функцію, яка вилучає всі петлі «псевдо графа», поданого «структурою 
суміжності». */
