#include <iostream>
using namespace std;

// task 1
/* Написати функцію для впорядкування за зростаючим порядком елементів списку у
зв'язному зберіганні, використовуючи «сортування вибором». */

// task 2
/* Використовуючи відповідний механізм черг або стеків, написати функцію, яка виводить
відмітки вузлів бінарного дерева, поданого у стандартній формі, по рівнях (починаючи з
кореня дерева, далі з синів кореня й далі). */

// task 3
/* Написати функцію, яка перевіряє суміжність двох заданих вершин у неорієнтованому
графі, що поданий структурою суміжності. */
